tap "armmbed/formulae"
tap "felixkratz/formulae"
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git"
tap "lizardbyte/homebrew"
tap "nikitabobko/tap"
tap "yoggy/tap"
brew "amfora"
brew "openssl@3"
brew "readline"
brew "python@3.13"
brew "tree"
brew "ansible"
brew "b2-tools"
brew "bandwhich"
brew "ncurses"
brew "bash"
brew "bat"
brew "freetype"
brew "bazel"
brew "node"
brew "bitwarden-cli"
brew "boost"
brew "bottom"
brew "broot"
brew "btop"
brew "fluid-synth"
brew "liblo"
brew "carla"
brew "choose-rust"
brew "chuck"
brew "cmake", link: false
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "pkgconf"
brew "jack"
brew "csound"
brew "libusb"
brew "dfu-util"
brew "difftastic"
brew "diskonaut"
brew "dos2unix"
brew "dua-cli"
brew "dust"
brew "emacs", restart_service: :changed, link: false
brew "eza"
brew "fastfetch"
brew "fd"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gawk"
brew "gemini-cli"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gtk+3"
brew "htop"
brew "hugo"
brew "hyperfine"
brew "iperf3"
brew "jpeg"
brew "pandoc"
brew "jupyterlab"
brew "just"
brew "kondo"
brew "libagg"
brew "libpq"
brew "lilypond"
brew "lolcat"
brew "lua"
brew "lynx"
brew "make"
brew "mise"
brew "mkvtoolnix"
brew "mprocs"
brew "neofetch"
brew "neovim"
brew "newsboat"
brew "nmap"
brew "nushell"
brew "ollama", restart_service: :changed
brew "opencode"
brew "p7zip"
brew "pipes-sh"
brew "pipx"
brew "podman"
brew "postgresql@14", restart_service: :changed
brew "potrace"
brew "procs"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "python@3.12"
brew "qrencode"
brew "ripgrep"
brew "rust"
brew "sd"
brew "sevenzip"
brew "starship"
brew "stockfish"
brew "stow"
brew "tailscale", restart_service: :changed
brew "tcl-tk"
brew "thefuck"
brew "tmux"
brew "tokei"
brew "util-linux"
brew "uv"
brew "wakeonlan"
brew "watch"
brew "webkit2png"
brew "wget"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "felixkratz/formulae/sketchybar"
cask "5ire"
cask "adium"
cask "aerospace"
cask "alacritty"
cask "anaconda"
cask "angry-ip-scanner"
cask "anki"
cask "audacity"
cask "balenaetcher"
cask "barrier"
cask "beeper"
cask "bespoke"
cask "bitwarden"
cask "blackhole-16ch"
cask "blender"
cask "blip"
cask "brackets"
cask "brave-browser"
cask "browseros"
cask "calibre"
cask "cardinal"
cask "chromium"
cask "cmake-app"
cask "coteditor"
cask "cyberduck"
cask "dbeaver-community"
cask "element"
cask "emacs-app"
cask "espanso"
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "font-victor-mono"
cask "frescobaldi"
cask "gdisk"
cask "geekbench"
cask "ghostty"
cask "gimp"
cask "github"
cask "gpg-suite"
cask "handbrake-app"
cask "home-assistant"
cask "hydrogen"
cask "inkscape"
cask "ipfs-desktop"
cask "iterm2"
cask "kando"
cask "katrain"
cask "kiibohd-configurator"
cask "kitty"
cask "kiwix"
cask "krita"
cask "lagrange"
cask "localsend"
cask "logseq"
cask "love"
cask "macfuse"
cask "mactex"
cask "makemkv"
cask "midi-monitor"
cask "milkytracker"
cask "mixxx"
cask "moonlight"
cask "mullvad-browser"
cask "mullvad-vpn"
cask "musescore"
cask "netnewswire"
cask "nextcloud"
cask "obs"
cask "obsidian"
cask "ocenaudio"
cask "onionshare"
cask "orcaslicer"
cask "pd"
cask "phoenix-code"
cask "pixieditor"
cask "plex"
cask "plugdata"
cask "prusaslicer"
cask "pulsar"
cask "raspberry-pi-imager"
cask "ricochet-refresh"
cask "rustdesk"
cask "scribus"
cask "signal"
cask "siyuan"
cask "sonic-pi"
cask "sourcetree"
cask "stats"
cask "supercollider"
cask "surge-xt"
cask "syncthing-app"
cask "sysex-librarian"
cask "telegram"
cask "thunderbird"
cask "tor-browser"
cask "transmission"
cask "veracrypt"
cask "vlc"
cask "vscodium"
cask "webkinz"
cask "wezterm"
cask "whatsapp"
cask "wolfram-engine"
cask "xquartz"
cask "yubico-authenticator"
cask "zen"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "coenraads.bracket-pair-colorizer-2"
vscode "continue.continue"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "jeanp413.open-remote-ssh"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "ms-azuretools.vscode-docker"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "vscodevim.vim"
go "github.com/danielmiessler/fabric"
