tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/services"
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git"
tap "lizardbyte/homebrew"
brew "openssl@3"
brew "readline"
brew "python@3.13"
brew "ansible"
brew "b2-tools"
brew "bash"
brew "freetype"
brew "bazel"
brew "bitwarden-cli"
brew "boost"
brew "carla"
brew "chuck", link: false
brew "cmake", link: false
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "pkgconf"
brew "jack"
brew "csound"
brew "dos2unix"
brew "emacs", link: false
brew "eza"
brew "fd"
brew "python@3.12"
brew "tesseract"
brew "ffmpeg"
brew "gawk"
brew "git"
brew "git-lfs"
brew "gtk+3"
brew "ncurses"
brew "htop"
brew "hugo"
brew "jpeg"
brew "libagg"
brew "libpq"
brew "lilypond"
brew "lolcat"
brew "lynx"
brew "make"
brew "mkvtoolnix"
brew "neofetch"
brew "neovim"
brew "ollama", restart_service: :changed, link: false
brew "p7zip"
brew "pandoc"
brew "pipes-sh"
brew "podman"
brew "postgresql@14", restart_service: :changed
brew "potrace"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "qrencode"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "tailscale", restart_service: :changed
brew "tcl-tk"
brew "thefuck"
brew "tmux"
brew "tree"
brew "uv"
brew "wakeonlan"
brew "webkit2png"
brew "wget"
brew "yazi"
brew "zoxide"
cask "adium"
cask "alacritty"
cask "anaconda"
cask "angry-ip-scanner"
cask "anki"
cask "audacity"
cask "balenaetcher"
cask "barrier"
cask "beeper"
cask "bespoke"
cask "bitwarden"
cask "blackhole-16ch"
cask "blender"
cask "brave-browser"
cask "calibre"
cask "cardinal"
cask "cmake"
cask "coteditor"
cask "cyberduck"
cask "dbeaver-community"
cask "element"
cask "emacs"
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "font-victor-mono"
cask "frescobaldi"
cask "gdisk"
cask "geekbench"
cask "ghostty"
cask "gimp"
cask "github"
cask "godot"
cask "gpg-suite"
cask "handbrake"
cask "home-assistant"
cask "hydrogen"
cask "inkscape"
cask "ipfs"
cask "iterm2"
cask "java8"
cask "kiibohd-configurator"
cask "kitty"
cask "kiwix"
cask "krita"
cask "lagrange"
cask "libreoffice"
cask "logseq"
cask "love"
cask "macfuse"
cask "mactex"
cask "makemkv"
cask "midi-monitor"
cask "milkytracker"
cask "mixxx"
cask "moonlight"
cask "mullvadvpn"
cask "musescore"
cask "nextcloud"
cask "obs"
cask "obsidian"
cask "ocenaudio"
cask "orcaslicer"
cask "pd"
cask "plugdata"
cask "prusaslicer"
cask "pulsar"
cask "raspberry-pi-imager"
cask "rustdesk"
cask "scribus"
cask "signal"
cask "sonic-pi"
cask "stats"
cask "supercollider"
cask "surge-xt"
cask "syncthing"
cask "sysex-librarian"
cask "telegram"
cask "thunderbird"
cask "tor-browser"
cask "transmission"
cask "veracrypt"
cask "vlc"
cask "vscodium"
cask "webkinz"
cask "wezterm"
cask "whatsapp"
cask "xquartz"
cask "zen-browser"
vscode "anysphere.pyright"
vscode "beaugunderson.solidity-extended"
vscode "bmewburn.vscode-intelephense-client"
vscode "dart-code.dart-code"
vscode "davidanson.vscode-markdownlint"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "juanblanco.solidity"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rjmacarthy.twinny"
vscode "rust-lang.rust-analyzer"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wingrunr21.vscode-ruby"
